#include <iostream>
#include "tree.cpp"

/****************************************************************************************
* Задача 1 - Префиксно обхождане(първо посещаваме корена след това обхождаме децата).	*
*		prefix: 1, 2, 3, 4, 5, 6, 7, 8, 9, 10											*
* Задача 2 - Постфиксно обхождане(първо обхождаме децата накрая посещаваме корена).		*
*		postfix: 3, 5, 6, 4, 7, 8, 2, 9, 10, 1											*
* Задача 3 - Обхождане в дълбочина.														*
*		depth: = prefix																	*
* Задача 4 - Обхождане в широчина.														*
*		breadth: 1, 2, 9, 10, 3, 4, 7, 8, 5, 6											*
****************************************************************************************/

int main()
{
	Tree<int> t[11];
	t[1].addChild(t[2]);
	t[1].addChild(t[9]);
	t[1].addChild(t[10]);

	t[2].addChild(t[3]);
	t[2].addChild(t[4]);
	t[2].addChild(t[7]);
	t[2].addChild(t[8]);

	t[4].addChild(t[5]);
	t[4].addChild(t[6]);
	
	std::cout << t[1] << std::endl;

	return 0;
}